In [11]:
import pandas as pd
from pandas import DataFrame

In [12]:
data = pd.read_csv('new.csv')
data

      Brand    Year  Kms Driven       City  Mileage
0    Maruti     NaN       50000    Gurgaon       28
1   Hyundai  2014.0       30000      Delhi       27
2      Tata     NaN       60000        NaN       25
3  Mahindra  2015.0       25000      Delhi       26
4    Maruti     NaN       10000        NaN       28
5   Hyundai  2016.0       46000      Delhi       29
6   Renault  2014.0       31000        NaN       24
7      Tata  2018.0       15000        NaN       21
8    Maruti  2019.0       12000  Ghaziabad       24

In [13]:
#converter to make the data good:
def converter_na(cell):
    if cell == '':
        return 'Pune'
    return cell

def converter_date(cell):
    if cell =='':
        return 2011
    return cell

data = pd.read_csv('new.csv',converters= {
    'City' : converter_na
})

data

      Brand    Year  Kms Driven       City  Mileage
0    Maruti     NaN       50000    Gurgaon       28
1   Hyundai  2014.0       30000      Delhi       27
2      Tata     NaN       60000       Pune       25
3  Mahindra  2015.0       25000      Delhi       26
4    Maruti     NaN       10000       Pune       28
5   Hyundai  2016.0       46000      Delhi       29
6   Renault  2014.0       31000       Pune       24
7      Tata  2018.0       15000       Pune       21
8    Maruti  2019.0       12000  Ghaziabad       24

# Data Types:

The data type for a column in a DataFrame or a Series is known as the dtype.

In [16]:
data.Brand.dtype

dtype('O')

In [17]:
data.Year.dtype

dtype('float64')

In [18]:
data.City.dtype

dtype('O')

In [19]:
data.Mileage.dtype

dtype('int64')

In [25]:
data.dtypes #dtypes will return the data type of every column in our data set in general

Brand          object
Year          float64
Kms Driven      int64
City           object
Mileage         int64
dtype: object

One peculiarity to keep in mind (and on display very clearly here) is that columns consisting entirely of strings do not get their own type; they are instead given the object type

In [27]:
data.index.dtype #Datatype of the Index

dtype('int64')

It's possible to convert a column of one type into another wherever such a conversion makes sense by using the astype()

In [28]:
data.Mileage.astype('float64')

0    28.0
1    27.0
2    25.0
3    26.0
4    28.0
5    29.0
6    24.0
7    21.0
8    24.0
Name: Mileage, dtype: float64

# Date Type:

In [30]:
data1 = pd.read_csv('weather.csv')
data1

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [36]:
type[data1.day]

type[0     1/1/2017
1     1/2/2017
2     1/3/2017
3     1/4/2017
4     1/1/2017
5     1/2/2017
6     1/3/2017
7     1/4/2017
8     1/1/2017
9     1/2/2017
10    1/3/2017
11    1/4/2017
Name: day, dtype: object]

In [38]:
df = pd.read_csv('weather.csv',parse_dates=['day'])
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [39]:
df

          day      city  temperature  windspeed   event
0  2017-01-01  new york           32          6    Rain
1  2017-01-02  new york           36          7   Sunny
2  2017-01-03  new york           28         12    Snow
3  2017-01-04  new york           33          7   Sunny
4  2017-01-01    mumbai           90          5   Sunny
5  2017-01-02    mumbai           85         12     Fog
6  2017-01-03    mumbai           87         15     Fog
7  2017-01-04    mumbai           92          5    Rain
8  2017-01-01     paris           45         20   Sunny
9  2017-01-02     paris           50         13  Cloudy
10 2017-01-03     paris           54          8  Cloudy
11 2017-01-04     paris           42         10  Cloudy

In [46]:
df.set_index('day',inplace = True)
df

                city  temperature  windspeed   event
day
2017-01-01  new york           32          6    Rain
2017-01-02  new york           36          7   Sunny
2017-01-03  new york           28         12    Snow
2017-01-04  new york           33          7   Sunny
2017-01-01    mumbai           90          5   Sunny
2017-01-02    mumbai           85         12     Fog
2017-01-03    mumbai           87         15     Fog
2017-01-04    mumbai           92          5    Rain
2017-01-01     paris           45         20   Sunny
2017-01-02     paris           50         13  Cloudy
2017-01-03     paris           54          8  Cloudy
2017-01-04     paris           42         10  Cloudy

inplace = True will modify the original dataframe

Pandas also has some other data types called as Time series data and categorical data!!